public/xml/GetStatus.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wcf="http://wcf.dian.colombia"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Timestamp wsu:Id="TS-D6ED24B187F7F6A5C44F66BDC68658C1E7139C29"><wsu:Created>2020-07-27T03:45:47Z</wsu:Created><wsu:Expires>2020-07-27T20:25:47Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="SOENAC-D458EB157F15E55C850AB1E37ACA0EAD6E2FA5F1">
MIIHHDCCBgSgAwIBAgIQGPAiUq69aMtfGz6kohqMHjANBgkqhkiG9w0BAQsFADCB
qDEcMBoGA1UECQwTd3d3LmNlcnRpY2FtYXJhLmNvbTEPMA0GA1UEBwwGQk9HT1RB
MRkwFwYDVQQIDBBESVNUUklUTyBDQVBJVEFMMQswCQYDVQQGEwJDTzEYMBYGA1UE
CwwPTklUIDgzMDA4NDQzMy03MRgwFgYDVQQKDA9DRVJUSUNBTUFSQSBTLkExGzAZ
BgNVBAMMEkFDIFNVQiBDRVJUSUNBTUFSQTAgFw0yMDA3MjQyMDAzNDhaGA8yMDIx
MDcyNDIwMDM0NlowggEdMRQwEgYDVQQIDAtCT0dPVEEgRC5DLjEcMBoGA1UECwwT
RkFDVFVSQSBFTEVDVFJPTklDQTEQMA4GA1UEBRMHMTIwNTUyNjEaMBgGCisGAQQB
gbVjAgMTCjg5OTk5OTAwNzAxMTAvBgNVBAoMKFNVUEVSSU5URU5ERU5DSUEgREUg
Tk9UQVJJQURPIFkgUkVHSVNUUk8xFDASBgNVBAcMC0JPR09UQSBELkMuMTAwLgYJ
KoZIhvcNAQkBFiFSVUJFTi5TSUxWQUBTVVBFUk5PVEFSSUFETy5HT1YuQ08xCzAJ
BgNVBAYTAkNPMTEwLwYDVQQDDChTVVBFUklOVEVOREVOQ0lBIERFIE5PVEFSSUFE
TyBZIFJFR0lTVFJPMIIBIDANBgkqhkiG9w0BAQEFAAOCAQ0AMIIBCAKCAQEAjE9+
B0um5GIhkSgODd1nsW1SdO3bvV8EKbKDoY5LfY6iCDj4Mngr1UL662H2Y4RQSTqR
mG/PSszCvuY0awtLBxSTwxdZbIN/jqU025+IvebVVKCfPiiycleBzS3Ymezz9Bqa
zxbANDN71l/et0si4/yMJq/LiNm1+aSBCVvvV7wV9xCTo6stoa8+eJZxpkOkiAzv
Au0gws24ZG79ezqYo47dmHiO60qVT4zCwXaTLs1hZO1FBiDmRVqxFbzdN2R2NJzX
8AxnwLzrXN2sAJE1x/fFslCW1aWGFFg9NA0A5zNpAhSQ/OtofYnypGogV5l+9KoI
hh/CHIrhRh8M5JP8eQIBA6OCAsgwggLEMDYGCCsGAQUFBwEBBCowKDAmBggrBgEF
BQcwAYYaaHR0cDovL29jc3AuY2VydGljYW1hcmEuY28wLAYDVR0RBCUwI4EhUlVC
RU4uU0lMVkFAU1VQRVJOT1RBUklBRE8uR09WLkNPMIHnBgNVHSAEgd8wgdwwgZkG
CysGAQQBgbVjMgEIMIGJMCsGCCsGAQUFBwIBFh9odHRwOi8vd3d3LmNlcnRpY2Ft
YXJhLmNvbS9kcGMvMFoGCCsGAQUFBwICME4aTExpbWl0YWNpb25lcyBkZSBnYXJh
bnTtYXMgZGUgZXN0ZSBjZXJ0aWZpY2FkbyBzZSBwdWVkZW4gZW5jb250cmFyIGVu
IGxhIERQQy4wPgYLKwYBBAGBtWMKCgEwLzAtBggrBgEFBQcCAjAhGh9EaXNwb3Np
dGl2byBkZSBoYXJkd2FyZSAoVG9rZW4pMAwGA1UdEwEB/wQCMAAwDgYDVR0PAQH/
BAQDAgP4MCcGA1UdJQQgMB4GCCsGAQUFBwMBBggrBgEFBQcDAgYIKwYBBQUHAwQw
HQYDVR0OBBYEFCgy2Hg/ENm/8WdZl7ad0MEKedGbMB8GA1UdIwQYMBaAFIBxzDKS
WHX0AyE6q74c04/yIBXtMBEGCWCGSAGG+EIBAQQEAwIFoDCB1wYDVR0fBIHPMIHM
MIHJoIHGoIHDhl5odHRwOi8vd3d3LmNlcnRpY2FtYXJhLmNvbS9yZXBvc2l0b3Jp
b3Jldm9jYWNpb25lcy9hY19zdWJvcmRpbmFkYV9jZXJ0aWNhbWFyYV8yMDE0LmNy
bD9jcmw9Y3JshmFodHRwOi8vbWlycm9yLmNlcnRpY2FtYXJhLmNvbS9yZXBvc2l0
b3Jpb3Jldm9jYWNpb25lcy9hY19zdWJvcmRpbmFkYV9jZXJ0aWNhbWFyYV8yMDE0
LmNybD9jcmw9Y3JsMA0GCSqGSIb3DQEBCwUAA4IBAQAdX2NqzPmUWgAyRwstmKnO
EmNhgWPNnpM6VlyDBcOGMQaiBgNKa9GklZf+2tUr+GHAkYMr70EDSgbaIzewPoEu
bZqygmJ0YE46GD7R0aqSm6QChy29We2UK1IFDj6tfYwvi5AWI7Go8/R0ybvjwhnu
3CE5XS7TZ2xdqgGsqNk7ig3z5CD4xHEwgO+WB1ePEXEo1SFkjGC4fn2ZzulachNc
W03Rcaj5Dj6ZgSrI1++aIMCuPXBQfDgK0T+chc5msOjJw2mMBt4Axcckb6V/ftRk
NxtBpCXUHDJrcv79uJ4IjwTMfCgWpEliK9qVVa+mNAqlPuE7vCDhphRkptCSS5c3

</wsse:BinarySecurityToken><ds:Signature Id="SIG-1E3A10CACCB9CFA593FDA4D9AB320EB7457092C8" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="wsa soap wcf" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/><ds:Reference URI="#ID-ED2DD77D1B7F4BBC36965225E56DAC7FE9D26246"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soap wcf" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>IYPa5VwFYN24A5yiPafVQ8Jb8BHjss+Zwbu55hkZNIQ=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>I0xJfU4iVrJMuwMSYhKCSc3vsW8/9LtmfYOLbKyDkqd8xzaU3bt2n98s1BV0Brfq+SupGGecGg6QF2Exlay/o5JjvqqbU+dkkOud0TwD/UHKmYP41RUGsI17njiO9vMcaQBgjYZ7pCzY34wT0GDz933sdkXt01h85CMRF/I/hGgh4iRY7ZQNpTudIDIotuMFJ9Wp9watU2HlXBHoGb/Wfjqp8Ab3P6fL3sweHBY86tXzX2si9hoZlcEKs0n91p4NzRgDFxpjqcQJrGHKYe47ExqZSHZ7vcGF8hU9G0Npwl1IG6J9fRB2tY7qb9W31PUEUeBEuDpd8OR2TQqwBz0t2A==</ds:SignatureValue><ds:KeyInfo Id="KI-D882AFE2E688E28DDD4EA51D2C2DA4EF03368698"><wsse:SecurityTokenReference wsu:Id="STR-B40FE20EDA03D06E743241C35F7A94E5F9AF8D51"><wsse:Reference URI="#SOENAC-D458EB157F15E55C850AB1E37ACA0EAD6E2FA5F1" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security><wsa:Action>http://wcf.dian.colombia/IWcfDianCustomerServices/GetStatus</wsa:Action><wsa:To wsu:Id="ID-ED2DD77D1B7F4BBC36965225E56DAC7FE9D26246" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc</wsa:To></soap:Header>

    <soap:Body>
        <wcf:GetStatus>
            <wcf:trackId>fc8eac422eba16e22ffd8c6f94b3f40a6e38162c</wcf:trackId>
        </wcf:GetStatus>
    </soap:Body>
</soap:Envelope>
